Revit 2024 API
RevitServerUnauthenticatedUserException Class
The exception that is thrown when an unauthenticated user attempts to initiate a call to RevitServer.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[SerializableAttribute]
public class RevitServerUnauthenticatedUserException : RevitServerException
Visual Basic
<SerializableAttribute> _
Public Class RevitServerUnauthenticatedUserException _
	Inherits RevitServerException
Visual C++
[SerializableAttribute]
public ref class RevitServerUnauthenticatedUserException : public RevitServerException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.RevitServerException
 Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException
See Also
RevitServerUnauthenticatedUserException Members
Autodesk.Revit.Exceptions Namespace